
{
  "comment": "This is a mock ml model for food recognition.",
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.2.0",
  "convertedBy": "TensorFlow.js Converter v4.2.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "food_recognition_model",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "valid",
              "activation": "relu"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        }
      ]
    }
  ]
}